---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotComputeRailingsElevationWarn
source: html/42ee6da9-6d6c-e314-883d-fb79578a99c5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotComputeRailingsElevationWarn Property

Can't compute Railings Elevation Profile

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotComputeRailingsElevationWarn { get; }
```